// task1
// let numder=(1,2.3,4,5,6,7,8,9,10);
// for ( a = 1; a <= 10; a++) {
//     console.log(a);
//   }

//                                                                  // الفرق بينهم هو بس طريقة الكتابة
//   2
//   let numder=a = 1; //هون بجهز المتغير 
//   while (a <= 10) {      // الشرط  اذا اقل من او يساوي اطبع شرط
//     a++; 
// }
//    console.log(a)    
//    3   
//    for (let a = 0; a <= 10; a += 2) {
//     console.log(a);
//   }
//   let numder=(1,2.3,4,5,6,7,8,9,10);
// for ( a = 0; a <= 10; a +=2) {       // هون بدو نطبع الارقام الزوجيه لهيك بنكتب نعمل زياده 2
//     console.log(a);
// }
// //4
// let num=(1,2.3,4,5,6,7,8,9,10);
// for ( a = 1; a <= 10; a +=2) {       // هون بدو نطبع الارقام الفرديه لهيك بنكتب نعمل زياده عشان يطبعلي 1.3 2
//     console.log(a);
// }
//5

// let name = "John"; // هون عندي متغير ولازم اعرف قيمته واحط اسم 

// if (name === "John") { // هون اذا كانت الname =john اطبعلي 
//   console.log("Hello, John"); // اذا كان كله تممام اطبعلي معها Hello 
// }
//6
// let number = 10; // تعريف المتغير num وتعيين قيمته

// if (number % 2 === 0) {                        //اذا كان المتغير يقبل القسمه 
//   console.log("The number is even");                 //اذا كان شرطي صح يقبل راح يطبع 
// }



   

               
       
      
  





 

